БухЭксп/InformationRegisters/CW_РегламентныеЗадания.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_РегламентныеЗадания</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторЗадания</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/InformationRegisters/CW_ВнешниеПечатныеФормы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_ВнешниеПечатныеФормы</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Наименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Индекс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Обработка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ПодключаемыеОбъекты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Метаданное</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_МетаданныеКонфигурации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/Enums/CW_ТипыПодключаемыхОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>CW_ТипыПодключаемыхОбъектов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВнешняяОбработка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВнешнийОтчет</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

БухЭксп/Catalogs/CW_ПодключаемыеОбъекты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>CW_ПодключаемыеОбъекты</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Версия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВерсияПодсистемы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Вид</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Встроенная</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗаписи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИзмененияФайла</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>260</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Индекс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Настройка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаСубъекта</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеИспользуется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отладка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтладкаИмяОбработки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеВида</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазмерФайла</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасполагатьНаРабочемСтоле</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеОбработки</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяВнешнегоОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеОбработки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипВнешнегоОбъекта</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CW_ТипыПодключаемыхОбъектов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяВстроеннойОбработки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонПредставленияПечатнойФормы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МинимальнаяВерсияМодуля</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсторияИзменений</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>МетодыОбъекта</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Метод</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ФормыОбъекта</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТипФормы</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяФормы</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КомандыОбъекта</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяКартинки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяКоманды</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПредставлениеКоманды</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОсновнаяКоманда</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДоступностьОбъекта</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ГруппаПользователей</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.CW_ГруппыПользователей</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>РасположениеОбъекта</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Расположение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.CW_РазделыРабочегоСтола</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПараметрыВнешнейКоманды</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПредставлениеКоманды</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МетаданныеКонфигурации</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.CW_МетаданныеКонфигурации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяФормыОбъкта</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяТабличнойЧасти</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяКартинки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Индекс</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГруппыДоступаКоманды</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РасположениеГруппы</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПередЭлементом</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НазначениеОбъекта</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Назначение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Макросы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяМакроса</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПредставлениеМакроса</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МетодМакроса</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

БухЭксп/CommonModules/_ПО/Ext/Module.bsl
Функция ПодключитьОбработку(ПодключаемыйОбъект) Экспорт 
	
	Если НЕ ПодключаемыйОбъект.Встроенная Тогда
		
		АдресОбработки = ПолучитьНавигационнуюСсылку(ПодключаемыйОбъект,"ХранилищеОбработки");
		
		Если ПодключаемыйОбъект.ТипВнешнегоОбъекта = ПредопределенноеЗначение("Перечисление.CW_ТипыПодключаемыхОбъектов.ВнешнийОтчет") Тогда
			Менеджер = ВнешниеОтчеты;
		Иначе
			Менеджер = ВнешниеОбработки;
		КонецЕсли;
		
		Попытка
			Если ПодключаемыйОбъект.Отладка Тогда
				
				Файл = Новый Файл(ПодключаемыйОбъект.ОтладкаИмяОбработки);
				Если Не Файл.Существует() Тогда
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Файл обработки для отладки не доступен по указанному расположению.");
					Возврат Ложь;
				КонецЕсли;
				
				ИмяВнешнейОбработки = Менеджер.Создать(ПодключаемыйОбъект.ОтладкаИмяОбработки);
			Иначе			
				Если ОбщегоНазначения.ЕстьЗащитаОтОпасныхДействий() Тогда
					ИмяВнешнейОбработки = Менеджер.Подключить(АдресОбработки,ИдентификаторОбработки(ПодключаемыйОбъект) , Ложь,
					ОбщегоНазначения.ОписаниеЗащитыБезПредупреждений());
				Иначе
					ИмяВнешнейОбработки = Менеджер.Подключить(АдресОбработки,ИдентификаторОбработки(ПодключаемыйОбъект) , Ложь);
				КонецЕсли;
			КонецЕсли;
		Исключение
			Возврат Ложь;
		КонецПопытки;
		
	КонецЕсли; 
	
	Возврат Истина;
	
КонецФункции

Функция ПолучитьОбработку(ПодключаемыйОбъект,Заново=Ложь) Экспорт 
	// --- 
	
	// внимание: при загрузке новой обработки она должна быть подключена заново !
	
	// имя обработки - всегда УИД Подключаемого объекта
	
	
	Если (НЕ ПодключаемыйОбъект.Встроенная) Тогда
		
		Если (ПодключитьОбработку(ПодключаемыйОбъект)) Тогда
			
			Если ПодключаемыйОбъект.ТипВнешнегоОбъекта = ПредопределенноеЗначение("Перечисление.CW_ТипыПодключаемыхОбъектов.ВнешнийОтчет") Тогда
				Менеджер = ВнешниеОтчеты;
			Иначе
				Менеджер = ВнешниеОбработки;
			КонецЕсли;
			
			Если ПодключаемыйОбъект.Отладка Тогда
				Файл = Новый Файл(ПодключаемыйОбъект.ОтладкаИмяОбработки);
				Если Не Файл.Существует() Тогда
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Файл обработки для отладки не доступен по указанному расположению.");
					Возврат Ложь;
				КонецЕсли;
				
				ВнешняяОбработка = Менеджер.Создать(ПодключаемыйОбъект.ОтладкаИмяОбработки);
			Иначе
				ВнешняяОбработка = Менеджер.Создать(ИдентификаторОбработки(ПодключаемыйОбъект));
			КонецЕсли;
			
		Иначе
			Возврат(Неопределено);
		КонецЕсли;

	Иначе     
		
		УстановитьПривилегированныйРежим(Истина);
		
		// встроенная
		Если ПодключаемыйОбъект.ТипВнешнегоОбъекта = ПредопределенноеЗначение("Перечисление.CW_ТипыПодключаемыхОбъектов.ВнешнийОтчет") Тогда
			ВнешняяОбработка = Отчеты[ПодключаемыйОбъект.ИмяВстроеннойОбработки].Создать();
		Иначе
			ВнешняяОбработка = Обработки[ПодключаемыйОбъект.ИмяВстроеннойОбработки].Создать();
		КонецЕсли;
		
	КонецЕсли; 
			
	Возврат(ВнешняяОбработка);
	
КонецФункции

Функция ПолучитьСоответствиеВидаОбработкиРасширению()
	
	Соответствие = новый Соответствие;
	Соответствие.Вставить(ПредопределенноеЗначение("Перечисление.CW_ТипыПодключаемыхОбъектов.ВнешняяОбработка"),	".epf");
	Соответствие.Вставить(ПредопределенноеЗначение("Перечисление.CW_ТипыПодключаемыхОбъектов.ВнешнийОтчет"),		".erf");
	
	Возврат Соответствие;
	
КонецФункции

Функция ПолучитьПутьОбработки(Идентификатор) Экспорт 
	// --- 
	
	Возврат(КаталогВременныхФайлов()+Строка(Идентификатор.УникальныйИдентификатор())+_сф.ф_Разделитель());
	
	// --- 
КонецФункции

Функция ИдентификаторОбработки(ПодключаемыйОбъект) Экспорт 
	// --- 
	
	ИД = _сф.УИДСтрокой(ПодключаемыйОбъект);
	ИД = СтрЗаменить(ИД,"-","");
	ИД = "ПО_"+ИД;
	
	Возврат(ИД);
	
	// --- 
КонецФункции
  

// ---------------------------------------------------------------------------- 

// получаем 
Функция ПолучитьПолноеИмяФормы(ПодключаемыйОбъект, Имяформы, ТипФормы="" ) Экспорт
	
	ВидОбъекта = "";
	Если ПодключаемыйОбъект.Встроенная Тогда
		
		Если  ПодключаемыйОбъект.ТипВнешнегоОбъекта = ПредопределенноеЗначение("Перечисление.CW_ТипыПодключаемыхОбъектов.ВнешнийОтчет") Тогда
			ВидОбъекта = "Отчет.";
		Иначе
			ВидОбъекта = "Обработка.";
		Конецесли;
		
		ИмяОбъекта = СокрЛП(ПодключаемыйОбъект.ИмяВстроеннойОбработки);
	
	Иначе
		
		Если ПодключаемыйОбъект.Отладка Тогда
			ИмяОбъекта = ПодключаемыйОбъект.ИмяВнешнегоОбъекта;
		Иначе
			ИмяОбъекта = ИдентификаторОбработки(ПодключаемыйОбъект);
		КонецЕсли;
			
		Если  ПодключаемыйОбъект.ТипВнешнегоОбъекта = ПредопределенноеЗначение("Перечисление.CW_ТипыПодключаемыхОбъектов.ВнешнийОтчет") Тогда
			ВидОбъекта = "ВнешнийОтчет."; 
		Иначе
			ВидОбъекта = "ВнешняяОбработка."; 
		Конецесли;
		
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(Имяформы) Тогда
		ИмяОтрываемойФрмы = ".Форма." + Имяформы;
	Иначе
			ИмяОтрываемойФрмы = "."+ТипФормы;
	КонецЕсли;
	
	Возврат ВидОбъекта + ИмяОбъекта + ИмяОтрываемойФрмы;
	
КонецФункции


Функция ПолучитьПолноеИмяФормыПоТипу(ПодключаемыйОбъект,ТипФормы) Экспорт 
	
	Имяформы = ПолучитьИмяФормыПоТипу(ПодключаемыйОбъект, ТипФормы);
		
	Возврат ПолучитьПолноеИмяФормы(ПодключаемыйОбъект, Имяформы, ТипФормы);
	
КонецФункции

// получение имени формы обработки по типу
Функция ПолучитьИмяФормыПоТипу(ПодключаемыйОбъект,ТипФормы) Экспорт 
	// --- 
	
	СтрокаФормы = ПодключаемыйОбъект.ФормыОбъекта.Найти(ТипФормы,"ТипФормы");
	Если СтрокаФормы = Неопределено Тогда
		
		Возврат(Неопределено);
		
	Иначе
		
		Если СокрЛП(СтрокаФормы.ИмяФормы) = "" Тогда
			
			Возврат(Неопределено);
			
		Иначе
			
			Возврат(СтрокаФормы.ИмяФормы);
			
		КонецЕсли; 
		
	КонецЕсли; 
	
	// --- 
КонецФункции

// ---------------------------------------------------------------------------- 

// функция получения настроек подключаемой обработки
Функция ПолучитьНастройки(Объект,Субъект=Неопределено) Экспорт 
	// --- 
	
	УстановитьПривилегированныйРежим(Истина);
	
	Попытка
		
		Настройки = ХранилищеСистемныхНастроек.Загрузить("_ПО."+Строка(_сф.УИД(Объект)),?(Субъект=Неопределено,"Настройки",Строка(_сф.УИД(Субъект))),,"БухгалтерияЭкспедитора");
				
	Исключение
	    
		Настройки = Неопределено;
		
	КонецПопытки; 
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат(Настройки);
	
	// --- 
КонецФункции

// функция записи настроек подключаемой обработки
Функция ЗаписатьНастройки(Объект,Субъект=Неопределено,Настройки) Экспорт 
	// --- 
	
	УстановитьПривилегированныйРежим(Истина);
	
	Попытка
		
		ХранилищеСистемныхНастроек.Сохранить("_ПО."+Строка(_сф.УИД(Объект)),?(Субъект=Неопределено,"Настройки",Строка(_сф.УИД(Субъект))),Настройки,,"БухгалтерияЭкспедитора");
		Возврат(_УФКС.Ответ());
		
	Исключение
	    Возврат(_УФКС.Ответ(1,ОписаниеОшибки()));
	КонецПопытки; 
	
	УстановитьПривилегированныйРежим(Ложь);
	
	// --- 
КонецФункции

// --- 

Функция ПолучитьНастройкиОбработки(Объект) Экспорт 
	// --- 
	
	Возврат(ПолучитьНастройки(Объект));
	
	// --- 
КонецФункции

Функция ПолучитьНастройкиСубъекта(Объект,Субъект) Экспорт 
	// --- 
	
	Возврат(ПолучитьНастройки(Объект,Субъект));
	
	// --- 
КонецФункции

// --- 
  
Функция ЗаписатьНастройкиОбработки(Объект,Настройки) Экспорт
	// --- 
	
	Возврат(ЗаписатьНастройки(Объект,,Настройки));
	
	// --- 
КонецФункции

Функция ЗаписатьНастройкиСубъекта(Объект,Субъект,Настройки) Экспорт
	// --- 
	
	Возврат(ЗаписатьНастройки(Объект,Субъект,Настройки));
	
	// --- 
КонецФункции

// ---------------------------------------------------------------------------- 

Функция УдалитьСвязанныеРегламентныеЗадания(Объект) Экспорт 
	// --- 
	
	Попытка
		
		УстановитьПривилегированныйРежим(Истина);
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	CW_РегламентныеЗадания.ИдентификаторЗадания
		|ИЗ
		|	РегистрСведений.CW_РегламентныеЗадания КАК CW_РегламентныеЗадания
		|ГДЕ
		|	CW_РегламентныеЗадания.Объект = &Объект";
		Запрос.УстановитьПараметр("Объект", Объект);
		МассивЗаданий = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ИдентификаторЗадания");
		Для каждого Идентификатор Из МассивЗаданий Цикл
			
			Задание = РегламентныеЗадания.НайтиПоУникальномуИдентификатору(Идентификатор);
			Если Задание <> Неопределено Тогда
				
				Задание.Удалить();
				
			КонецЕсли; 
			
		КонецЦикла; 
		
		// удаляем из регистра
		НЗ = РегистрыСведений.CW_РегламентныеЗадания.СоздатьНаборЗаписей();
		_сф.УстановитьОтбор(НЗ.Отбор,"Объект",Объект);
		НЗ.Записать(Истина);
		
		УстановитьПривилегированныйРежим(Ложь);
		Возврат(_УФКС.Ответ());
		
	Исключение
		
		// пишем в лог
		ТекстОшибки = ОписаниеОшибки();
		CW_Журнал.ЗаписатьСообщение("Общее.РегистрацияСвязанногоЗадания","error",Строка(Объект)+Символы.ПС+ТекстОшибки);
		Возврат(_УФКС.Ответ(1,ТекстОшибки));
		
	КонецПопытки; 
		
	// --- 
КонецФункции

Функция ДобавитьСвязанноеРегламентноеЗадание(Объект,ИдентификаторЗадания) Экспорт 
	// --- 
	
	Попытка
		
		Запись = РегистрыСведений.CW_РегламентныеЗадания.СоздатьМенеджерЗаписи();
		Запись.Объект = Объект;
		Запись.ИдентификаторЗадания = ИдентификаторЗадания;
		Запись.Записать();
		
		Возврат(_УФКС.Ответ());
		
	Исключение
		
		ТекстОшибки = ОписаниеОшибки();
		CW_Журнал.ЗаписатьСообщение("Общее.РегистрацияСвязанногоЗадания","error",Строка(Объект)+Символы.ПС+ТекстОшибки);
		Возврат(_УФКС.Ответ(1,ТекстОшибки));
		
	КонецПопытки; 
	
		
	
	// --- 
КонецФункции

// ---------------------------------------------------------------------------- 

//УСТАРЕЛА. Следует использовать CW_ПодключаемыеКомандыСервер.ОбновитьРегистрациюПечатнойФормы
Функция ОбновитьРегистрациюПечатнойФормы(Обработка, Знач ПредставлениеОбработки = "", МассивМетаданных) Экспорт 
	
	ПредставлениеОбработки = ?(НЕ ЗначениеЗаполнено(ПредставлениеОбработки), СокрЛП(Обработка), ПредставлениеОбработки);
	
	Попытка
		
		Набор = РегистрыСведений.CW_ВнешниеПечатныеФормы.СоздатьНаборЗаписей();
		Набор.Отбор.Обработка.Установить(Обработка);
		Набор.Записать(Истина);
		
		Если Обработка.ПометкаУдаления Тогда
			Возврат _УФКС.Ответ();
		КонецЕсли; 
		
		Для Каждого Метаданное Из МассивМетаданных Цикл
			
			Запись = Набор.Добавить();
			Запись.Обработка 	= Обработка;
			Запись.Метаданное 	= CW_Обмены_ПИ.МетаданноеКонфигурации(Метаданное);
			
			Запись.Наименование = ПредставлениеОбработки;
			Запись.Индекс 		= Обработка.Индекс;
			
		КонецЦикла; 
		
		Набор.Записать(Истина);
		
		Возврат _УФКС.Ответ();
		
	Исключение
		
		Возврат _УФКС.Ответ(1,ОписаниеОшибки());
		
	КонецПопытки; 
	
КонецФункции

// ---------------------------------------------------------------------------- 
Функция ПолучитьИмяФормыНаСервере(Параметр, АдресОбъекта="") Экспорт
	                                                                             
	ПодключаемыйОбъект = Параметр.ВнешняяОбработкаПередНачаломВыбора;																				 
																				 
	Возврат Справочники.CW_ПодключаемыеОбъекты.ПодключитьОбъектИПолучитьФорму(ПодключаемыйОбъект,,АдресОбъекта);	
	
КонецФункции

Функция ПолучитьСтруктуруОтветавнешнейФормы(ВыбранноеЗначение, Параметр) Экспорт
	
	СтруктураОтвета = CW_МониторинговыеПараметрыСервер.ПолучитьПустуюСтруктуруРедактированияПараметров();
	СтруктураОтвета.Параметр 		= Параметр;
	СтруктураОтвета.ПараметрИзменен = Истина;
	СтруктураОтвета.Значение 		= ВыбранноеЗначение;
	
	Возврат СтруктураОтвета;
	
КонецФункции

Функция ПолучитьИмяВыбраннойФормы(ПараметрыПолученияФормы) Экспорт
	
	// при отсутствии прав на использование модуля или полных прав 
	Если НЕ Пользователи.РолиДоступны("БухгалтерияЭкспедитора,ПолныеПрава") Тогда
		Возврат Неопределено;	
	КонецЕсли;
	
	ИмяМетаданных	= СокрЛП(ПараметрыПолученияФормы.Источник);
	
	ИмяМетаданных	= СтрЗаменить(ИмяМетаданных,"СправочникМенеджер"				,"Справочник");
	ИмяМетаданных	= СтрЗаменить(ИмяМетаданных,"ДокументМенеджер"					,"Документ");
	ИмяМетаданных	= СтрЗаменить(ИмяМетаданных,"ОтчетМенеджер"						,"Отчет");
	ИмяМетаданных	= СтрЗаменить(ИмяМетаданных,"ОбработкаМенеджер"					,"Обработка");
	ИмяМетаданных	= СтрЗаменить(ИмяМетаданных,"ПланВидовХарактеристикМенеджер"	,"ПланВидовХарактеристик");
	
	СсылкаОбъектаМетаданных = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(ИмяМетаданных);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	CW_ПодключаемыеФормы.ПодключаемыйОбъект КАК ПодключаемыйОбъект
	               |ИЗ
	               |	Справочник.CW_ПодключаемыеФормы КАК CW_ПодключаемыеФормы
	               |ГДЕ
	               |	CW_ПодключаемыеФормы.НеИспользуется = ЛОЖЬ
	               |	И CW_ПодключаемыеФормы.ПометкаУдаления = ЛОЖЬ
	               |	И CW_ПодключаемыеФормы.ИдентификаторОбъектаМетаданных = &ИдентификаторОбъектаМетаданных";
	
	Запрос.УстановитьПараметр("ИдентификаторОбъектаМетаданных", СсылкаОбъектаМетаданных);
	
	РезультатЗапроса 	= Запрос.Выполнить();
	Выборка 		 	= РезультатЗапроса.Выбрать();
	
	ПодключаемаяФорма 	= Неопределено;
	Если Выборка.Следующий() Тогда	
		
		ВнешняяОбработка 	= ПолучитьОбработку(Выборка.ПодключаемыйОбъект);
		ИмяФормы 			= ВнешняяОбработка.ПолучитьИмяПодключаемойФормы(ПараметрыПолученияФормы.ВидФормы);
		
		Если ИмяФормы <> Неопределено Тогда
			ПодключаемаяФорма 	= ВнешняяОбработка.Метаданные().Формы[ИмяФормы];
		Конецесли;
		
	КонецЕсли;
	
	Возврат ПодключаемаяФорма;
	
КонецФункции


Процедура ЗаполнитьИнформациюПоОбработке(Объект,СтруктураОписания) Экспорт 
	
	// пишем прочие параметры обработки
	ТипВнешнегоОбъекта = Неопределено;
	СтруктураОписания.Свойство("Тип",	ТипВнешнегоОбъекта);
	Если ТипЗнч(ТипВнешнегоОбъекта) = Тип("Строка") Тогда
		//Поддержка версий ниже 8.3.10.10
		СоответствиеТипов 			= Справочники.CW_ПодключаемыеОбъекты.ПолучитьСоответствиеТипов();
		Объект.ТипВнешнегоОбъекта	= СоответствиеТипов.Получить(ТипВнешнегоОбъекта);
		//Поддержка версий ниже 8.3.10.10
	Иначе
		Объект.ТипВнешнегоОбъекта	= ТипВнешнегоОбъекта;
	КонецЕсли;
	
	СтруктураОписания.Свойство("Вид",			Объект.Вид);
	Объект.ПредставлениеВида = CW_ПодключаемыеКомандыСервер.ПолучитьПредсталениеВида(Объект.Вид);
	
	СтруктураОписания.Свойство("Версия",			Объект.Версия);
	СтруктураОписания.Свойство("ВерсияПодсистемы",	Объект.ВерсияПодсистемы);
	СтруктураОписания.Свойство("ИсторияИзменений",	Объект.ИсторияИзменений);
	
	Если Не ЗначениеЗаполнено(Объект.Наименование) Тогда
		СтруктураОписания.Свойство("Наименование",		Объект.Наименование);
	КонецЕсли;

	СтруктураОписания.Свойство("Поставщик",			Объект.Поставщик);
	СтруктураОписания.Свойство("Описание",			Объект.Описание);
	
	СтруктураОписания.Свойство("МинимальнаяВерсияМодуля",	Объект.МинимальнаяВерсияМодуля);  
	
	Если Объект.Ссылка.Пустая()
		И СтруктураОписания.Свойство("Индекс") Тогда  
		Объект.Индекс = СтруктураОписания.Индекс;
	КонецЕсли;
	
	РасполагатьНаРабочемСтоле 			= _сф.ст_ПолучитьСвойство(СтруктураОписания,"РасполагатьНаРабочемСтоле");
	Объект.РасполагатьНаРабочемСтоле 	= ?(РасполагатьНаРабочемСтоле=Неопределено,Ложь,РасполагатьНаРабочемСтоле);
	
	ФлагНастройки 		= _сф.ст_ПолучитьСвойство(СтруктураОписания,"Настройка");
	Объект.Настройка	= ?(ФлагНастройки=Неопределено,Ложь,ФлагНастройки);
	
	ФлагНастройкиСубъекта 		= _сф.ст_ПолучитьСвойство(СтруктураОписания,"НастройкаСубъекта");
	Объект.НастройкаСубъекта	= ?(ФлагНастройкиСубъекта=Неопределено,Ложь,ФлагНастройкиСубъекта);
	
	
	// Назначение
	Объект.НазначениеОбъекта.Очистить();
	Если ТипЗнч(_сф.ст_ПолучитьСвойство(СтруктураОписания,"НазначениеОбъекта"))=Тип("Массив") Тогда
		СоответствиеИдентифкаторов = ОбщегоНазначения.ИдентификаторыОбъектовМетаданных(СтруктураОписания.НазначениеОбъекта);
		Для каждого НазначениеОбъекта Из СтруктураОписания.НазначениеОбъекта Цикл
			Нстр = Объект.НазначениеОбъекта.Добавить();
			Нстр.Назначение = СоответствиеИдентифкаторов.Получить(НазначениеОбъекта);
		КонецЦикла; 
	КонецЕсли;	
	
	// методы
	Объект.МетодыОбъекта.Очистить();
	Если ТипЗнч(_сф.ст_ПолучитьСвойство(СтруктураОписания,"Методы"))=Тип("Массив") Тогда
		Для каждого Метод Из СтруктураОписания.Методы Цикл
			Нстр = Объект.МетодыОбъекта.Добавить();
			Нстр.Метод = Метод;
		КонецЦикла; 
	КонецЕсли; 
	
	// формы
	Объект.ФормыОбъекта.Очистить();
	Если ТипЗнч(_сф.ст_ПолучитьСвойство(СтруктураОписания,"Формы"))=Тип("Массив") Тогда
		Для каждого СтруктураФормы Из СтруктураОписания.Формы Цикл
			Нстр = Объект.ФормыОбъекта.Добавить();
			Нстр.ТипФормы = СтруктураФормы.Тип;
			Нстр.ИмяФормы = СтруктураФормы.Имя;
		КонецЦикла; 
	КонецЕсли; 
	
	//Команды   
	Если СтруктураОписания.Свойство("РасполагатьНаРабочемСтоле") Тогда
		Если СтруктураОписания.РасполагатьНаРабочемСтоле Тогда
			//Если команда отображается на рабочем столе, то список очищаем
			Объект.КомандыОбъекта.Очистить();
		КонецЕсли;                                                        
	КонецЕсли;
	
	Если ТипЗнч(_сф.ст_ПолучитьСвойство(СтруктураОписания,"КомандыОбъекта"))=Тип("Массив") Тогда
		
		Для каждого СтруктураКоманд Из СтруктураОписания.КомандыОбъекта Цикл
			
			ИмяКоманды = _сф.ст_ПолучитьСвойство(СтруктураКоманд,"ИмяКоманды");
			
			Отбор = Новый Структура;
			Отбор.Вставить("ИмяКоманды", 	ИмяКоманды);
			
			мСтроки = Объект.КомандыОбъекта.НайтиСтроки(Отбор);
			Если мСтроки.Количество() > 0 Тогда
				//Эта команда есть, не добавляем
				Продолжить;
			КонецЕсли;
			
			Нстр 						= Объект.КомандыОбъекта.Добавить();
			
			ИмяКартинки 				= _сф.ст_ПолучитьСвойство(СтруктураКоманд,"ИмяКартинки");
			Нстр.ИмяКартинки 			= ?(ИмяКартинки=Неопределено,"",ИмяКартинки);
			
			Нстр.ИмяКоманды 			= ИмяКоманды;
			
			ПредставлениеКоманды 		= _сф.ст_ПолучитьСвойство(СтруктураКоманд,"ПредставлениеКоманды");
			Нстр.ПредставлениеКоманды	= ?(ПредставлениеКоманды=Неопределено,"",ПредставлениеКоманды);
			
			ОсновнаяКоманда 			= _сф.ст_ПолучитьСвойство(СтруктураКоманд,"ОсновнаяКоманда");
			Нстр.ОсновнаяКоманда		= ?(ОсновнаяКоманда=Неопределено,Ложь,ОсновнаяКоманда);
			
		КонецЦикла; 
		
	КонецЕсли; 
	
	//Внешешние команды
	Если ТипЗнч(_сф.ст_ПолучитьСвойство(СтруктураОписания,"ПараметрыВнешнейКоманды"))=Тип("Массив") Тогда
		
		Для каждого СтруктураКоманд Из СтруктураОписания.ПараметрыВнешнейКоманды Цикл
			
			ИмяМетаданногоКонфигурации		= _сф.ст_ПолучитьСвойство(СтруктураКоманд,	"МетаданныеКонфигурации");
			СсылкаМетаданногоКонфигурации	= CW_Обмены_ПИ.МетаданноеКонфигурации(ИмяМетаданногоКонфигурации);
			МетаданныеКонфигурации			= ?(СсылкаМетаданногоКонфигурации=Неопределено,	Справочники.CW_МетаданныеКонфигурации.ПустаяСсылка(),	СсылкаМетаданногоКонфигурации);
			
			ИмяФормыОбъкта	= _сф.ст_ПолучитьСвойство(СтруктураКоманд,"ИмяФормыОбъкта");
			ИмяФормыОбъкта 	= ?(ИмяФормыОбъкта=Неопределено,			"", ИмяФормыОбъкта);
			
			ИмяТабличнойЧасти 					= _сф.ст_ПолучитьСвойство(СтруктураКоманд,"ИмяТабличнойЧасти");
			ИмяТабличнойЧасти		= ?(ИмяТабличнойЧасти=Неопределено,			"", ИмяТабличнойЧасти);

			Отбор = Новый Структура;
			Отбор.Вставить("МетаданныеКонфигурации", 	МетаданныеКонфигурации);
			Отбор.Вставить("ИмяФормыОбъкта", 			ИмяФормыОбъкта);
			Отбор.Вставить("ИмяТабличнойЧасти", 		ИмяТабличнойЧасти);
			
			мСтроки = Объект.ПараметрыВнешнейКоманды.НайтиСтроки(Отбор);
			Если мСтроки.Количество() > 0 Тогда
				//Команда для этого объекта уже есть, не добавляем
				Продолжить;
			КонецЕсли;
			
			НоваяСтрока 						= Объект.ПараметрыВнешнейКоманды.Добавить();
			
			ПредставлениеКоманды 				= _сф.ст_ПолучитьСвойство(СтруктураКоманд,	"ПредставлениеКоманды");
			НоваяСтрока.ПредставлениеКоманды 	= ?(ПредставлениеКоманды =Неопределено,		"",	ПредставлениеКоманды);
			
			НоваяСтрока.МетаданныеКонфигурации 	= МетаданныеКонфигурации;
			НоваяСтрока.ИмяФормыОбъкта			= ИмяФормыОбъкта;
			НоваяСтрока.ИмяТабличнойЧасти		= ИмяТабличнойЧасти;
			
			РасположениеГруппы 					= _сф.ст_ПолучитьСвойство(СтруктураКоманд,"РасположениеГруппы");
			НоваяСтрока.РасположениеГруппы		= ?(РасположениеГруппы=Неопределено, "", РасположениеГруппы);
			
			ПередЭлементом 						= _сф.ст_ПолучитьСвойство(СтруктураКоманд,"ПередЭлементом");
			НоваяСтрока.ПередЭлементом			= ?(ПередЭлементом=Неопределено, "", ПередЭлементом);

			ИмяКартинки 						= _сф.ст_ПолучитьСвойство(СтруктураКоманд,"ИмяКартинки");
			НоваяСтрока.ИмяКартинки				= ?(ИмяКартинки=Неопределено, "", ИмяКартинки);
			
			Индекс 								= _сф.ст_ПолучитьСвойство(СтруктураКоманд,"Индекс");
			НоваяСтрока.Индекс					= ?(Индекс=Неопределено, 0, Индекс);
			
		КонецЦикла; 
		
	КонецЕсли; 
	
	//Макросы
	Объект.Макросы.Очистить();
	Если ТипЗнч(_сф.ст_ПолучитьСвойство(СтруктураОписания,"ТаблицаМакросов"))=Тип("ТаблицаЗначений") Тогда
		Для Каждого СтрокаТаблицы из СтруктураОписания.ТаблицаМакросов Цикл
			СтрокаМакроса = Объект.Макросы.Добавить();
			СтрокаМакроса.ИмяМакроса 			= СтрокаТаблицы.ИмяМакроса;
			СтрокаМакроса.ПредставлениеМакроса 	= СтрокаТаблицы.ПредставлениеМакроса;
			СтрокаМакроса.МетодМакроса 			= СтрокаТаблицы.МетодМакроса;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры
